# Pandas :  PandaSQL & SQLite3 

#### Extract Year, Month, and Day from Dateime

In [1]:
import numpy as np
import pandas as pd
import datetime as dt

In [2]:
# Changing the max_rows value 
# pd.set_option("display.max_rows", 5) 
# Changing the max_colwidth value 
pd.set_option("display.max_colwidth", 50)

In [3]:
import pandasql as ps

In [4]:
import sqlite3

### Example 1 : PANDASQL

In [5]:
from pandasql import sqldf, load_meat, load_births
pysqldf = lambda q: sqldf(q, globals())

In [6]:
meat  = load_meat()
birth = load_births()

In [7]:
myquery = """SELECT 
        SUBSTR(date,1,4) as year, 
        SUBSTR(date,6,2) as month,
        SUBSTR(date,10,2) as day
        FROM meat LIMIT 10;"""
pysqldf(myquery).head(3)

   year month day
0  1944    01  1
1  1944    02  1
2  1944    03  1

### Example 1 : SQLITE3

In [8]:
conn = sqlite3.connect(":memory:")
meat.to_sql('meatTable', conn)

827

In [9]:
myquery = """SELECT 
        strftime('%Y', date) as year,
        strftime('%m', date) as month,
        strftime('%d', date) as day
        FROM meatTable"""
pd.read_sql(myquery, conn).head(3)

   year month day
0  1944    01  01
1  1944    02  01
2  1944    03  01

### Example 2 : PANDASQL

#### Finf the N-th highest salary

In [10]:
eid  = [1,2,3,4,5,6,7,8]
name = ["Jone Doe","David Boe","Alice Jones","Bobby Louis","Lisa Romero","Anne Marry","Kisa Salero","Adam Smith"]
salary = [3315,7790,6000,3315,6000,8100,6985,7450]
df = pd.DataFrame({"id":eid, "name":name, "salary":salary})
df

   id         name  salary
0   1     Jone Doe    3315
1   2    David Boe    7790
2   3  Alice Jones    6000
3   4  Bobby Louis    3315
4   5  Lisa Romero    6000
5   6   Anne Marry    8100
6   7  Kisa Salero    6985
7   8   Adam Smith    7450

In [11]:
q = """
    SELECT 
    DISTINCT(salary)
    FROM df
    ORDER BY salary DESC;
    """
a = ps.sqldf(q)
print(a)

   salary
0    8100
1    7790
2    7450
3    6985
4    6000
5    3315

### Example 2 : SQLITE3

In [12]:
conn = sqlite3.connect(":memory:")
df.to_sql('tab', conn)

8

In [13]:
myquery = """
    SELECT 
    DISTINCT(salary)
    FROM tab
    ORDER BY salary DESC
    LIMIT 1 OFFSET 2
    """
pd.read_sql(myquery, conn)

   salary
0    7450